Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: རང་བཞིན་སྟོང་པ་ཉིད་དེ་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: That emptiness of a basic nature is also called “perfection.” “

source: །རང་བཞིན་སྟོང་པ་ཉིད་དེ་ཡང་སྔོན་གྱི་མཐར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པས་དུས་གསུམ་ཅར་དུ་ཡང་སྟོང་པ་ཉིད་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: That emptiness of a basic nature, furthermore, is the emptiness of a basic nature at the prior limit,” and so on, teaches it is emptiness at all three times. “

source: །འདི་ལྟར་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ལ་ཡང་སྤྱོད་ཅིང་རང་བཞིན་སྟོང་པ་ཉིད་དེ་ཡང་རྣམ་པར་འཁྲུག་པར་མི་བགྱིད་པ་དེ་ངོ་མཚར་ཏོ་ཞེས་བྱ་བ་ནི་ཡོད་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལ་སྤྱོད་ན།
en: Thus, it is amazing how they practice all dharmas that are the emptiness of a basic nature without complicating the emptiness of a basic nature.”

source: སྟོང་པ་ཉིད་རྣམ་པར་འཁྲུག་པར་འགྱུར་བར་དགོངས་པའོ།
en: The idea is that engaging with dharmas that do not exist would complicate emptiness.

source: །དེ་བས་ན་གཟུགས་ཀྱང་གཞན་མ་ཡིན་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསོལ་ཏེ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་སྤྱོད་པ་ན་གཟུགས་ལ་སོགས་པ་དེ་དག་གཞན་ལ་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ་ཞེས་བྱ་བ་མེད་ཀྱི། གཟུགས་ལ་སོགས་པ་དེ་དག་ཉིད་སྟོང་པ་ཉིད་དུ་མཐོང་བ་དེ་ངོ་མཚར་ཏོ་ཞེས་བྱའོ།
en: So, he says “form is not one thing and the emptiness of a basic nature another.” Thus, it is saying “it is amazing” how when bodhisattvas engage with phenomena, they see that form and so on “is not one thing and the emptiness of a basic nature another,” that just those, form and so on, are the emptiness of a basic nature. “

source: །གཟུགས་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དུས་ན་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མངོན་པར་རྫོགས་པར་རྟོགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་དག་ལ་ཐ་དད་པ་མེད་པའི་ཕྱིར་རོ།
en: Fully awaken to form itself as the knower of all aspects”— this means fully awakening to the dharmas, form and so on, at the time of the knowledge of all aspects because there is no difference between them. “

source: །གཞན་དུ་ན་ལྷ་དང་བཅས། བདུད་དང་བཅས། ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་ཞེས་བྱ་བ་ལ། གཞན་དུ་ན་ཞེས་བྱ་བ་ནི་གཅིག་ཁོ་ནར་ཏེ་ཞེས་བྱ་བ་སྟེ། འཇིག་རྟེན་པ་རྣམས་གཅིག་ཁོ་ནར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མི་ཤེས་ཏེ།
en: On the contrary, the world together with the gods, together with Māra, together with Brahmā”— “on the contrary,” they do not know that form and so on are only one.

source: མི་ཤེས་པས། དེ་ལ་མངོན་པར་ཞེན་ནས་ལས་བསགས་ཏེ། གཟུགས་ལ་སོགས་པའི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་འཛིན་ཅིང་ཉེ་བར་ལེན་ཏོ། །ཉེ་བར་ལེན་པའི་རྒྱུས་ཀྱང་སྲིད་པར་འགྱུར་ཏེ།
en: It means ordinary beings “do not know” as they really are that form and so on are only one, and “on account of not knowing,” they “settle down on” them and accumulate karma, grasp hold of and “appropriate form,” and so on, that are its maturation.

source: སྡུག་བསྔལ་ལས་ཡོངས་སུ་མི་འགྲོལ་ལོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: On account of that they come into suffering existence caused by appropriation, and “are not liberated from” suffering. “…

source: །རང་བཞིན་སྟོང་པ་ཉིད་ནི་སྟོང་པའམ་མི་སྟོང་པ་ཞེས་བྱ་བར་གཟུགས་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་གཉིས་སུ་འདུ་ཤེས་པས་གཟུགས་སྟོང་པ་ཉིད་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་དོ་ཞེས་བྱ་བ་སྟེ།
en: the emptiness of a basic nature … [they] do not complicate form with ‘it is empty, or it is not empty.’ ” Form does not make emptiness complicated on account of the perception of duality, because there is no duality. “

source: གཉིས་སུ་མེད་པའི་ཕྱིར་རོ། །དེ་དག་ལ་གང་འདི་ལྟར་འདི་ནི་གཟུགས་སོ། །འདི་ནི་སྟོང་པའོ་ཞེས་རྣམ་པར་འཁྲུག་པར་བྱེད་པ་དེ་ལྟ་བུའི་རང་བཞིན་མེད་དོ་ཞེས་བྱ་བ་ནི། དངོས་པོའི་བདག་ཉིད་ཀྱི་ངོ་བོ་ཉིད་མེད་པའོ།
en: It is because the ‘this is form,’ and ‘this is emptiness’… that might make that sort of complication have no intrinsic existence”— no intrinsic existence that constitutes an existent thing. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིས་སུ་དབྱེ་བས་བྱང་ཆུབ་དང་གཟུགས་ལ་མི་སྤྱོད་དོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ལ་གཉིས་སུ་བྱས་ནས་གཟུགས་ལ་མི་སྤྱོད་དེ།
en: Bodhisattva great beings do not practice awakening and form within having made a division.” “They do not practice form having made a division in awakening.”

source: བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ལ་སྤྱོད་ཅེས་བྱ་བར་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་ཀྱང་གཉིས་སུ་བྱས་ནས་གཟུགས་ལ་མི་སྤྱོད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they do not engage with form having made a division into the bodhisattva and the awakening in “bodhisattvas practice awakening.” “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདག་བྱང་ཆུབ་དང་གཟུགས་ལ་སྤྱོད་དོ་སྙམ་དུ་མི་སེམས་སོ་ཞེས་བྱ་བ་ནི་བདག་བྱང་ཆུབ་ལ་སྤྱོད་དོ་སྙམ་ནས་གཉིས་སུ་བྱས་ཏེ་གཟུགས་ལ་མི་སྤྱོད་པའོ།
en: Subhūti, bodhisattva great beings do not think, ‘I am practicing awakening and form.’ ” They do not, making a division, engage with form, thinking, “I am practicing awakening.” “

source: །འཛིན་པ་ལ་སྤྱོད་ཅེས་བྱ་བ་ནི་མཚན་མ་ལ་སྤྱོད་པའོ།
en: A practice of taking anything up”— engaging with a causal sign. “

source: །གཟུགས་ཀྱི་རང་བཞིན་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ནི་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ལ་གནས་པའོ།
en: Stand in the basic nature of form”— stand in the emptiness of form. “

source: །དེ་ཡང་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་བཏགས་པ་ཉེ་བར་བཟུང་ནས་ཞེས་བྱ་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་དོན་དམ་པར་མེད་དོ་ཞེས་བསྟན་པའོ།
en: Moreover, … simply based on… labeled by way of ordinary convention” teaches that ultimately even unsurpassed, perfect, complete awakening does not exist.

source: །ཆོས་དེ་དག་ཉིད་ལ་སྤྱོད་ཅེས་བྱ་བ་ནི་སྦྱིན་པ་དང་། སྦྱིན་བདག་ལ་སོགས་པ་མི་དམིགས་སུ་ཟིན་ཀྱང་སྦྱིན་པ་ལ་སོགས་པ་དེ་དག་ཉིད་ལ་སྤྱོད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: When they practice just those dharmas it means they practice just those, giving and so on, “without apprehending giving, … a benefactor,” and so on. “

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Lord, how, when bodhisattva great beings are practicing the perfection of wisdom, do they make an effort at the awakening path?”

source: བྱང་ཆུབ་ཀྱི་ལམ་ལ་བརྩོན་པར་བགྱིད་པ་ལགས་ཞེས་བྱ་བ་ནི་གལ་ཏེ་བྱང་ཆུབ་ཀྱི་ལམ་ཐམས་ཅད་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: How, if all the awakening path does not exist, is the idea. “[

source: །གཟུགས་མི་སྦྱོར་མི་འབྱེད་དེ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པ་མེད་པའི་ཕྱིར་རོ།
en: They] do not disengage from form,” because form and so on do not exist. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཇི་ལྟར་མངོན་པར་འགྲུབ་པར་འགྱུར་ཞེས་བྱ་བ་ནི་དེ་མེད་པའི་ཕྱིར་རོ།
en: How will the perfection of wisdom… be accomplished” given that it does not exist?

source: །ཐབས་མཁས་པ་བཤད་པ་དང་། གཟུང་དུ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཤད་པ་དག་ནི་གོ་སླའོ།
en: The explanations of skillful means and of the perfection of wisdom that cannot be grasped are easy to understand.

source: །ཇི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་མངོན་པར་ཞེན་པར་གྱུར་པ་ལྟ་བུའི་དངོས་པོ་ཡོད་པར་གྱུར་ཏམ།
en: The question, “Has there been or will there be a real basis of form in the way a foolish ordinary person has settled down on it?”

source: ཡོད་པར་འགྱུར་རམ་ཞེས་སྨོས་པ་ནི་དུས་གསུམ་ཅར་གྱི་སྨོས་པའོ།
en: is a statement about the three times. “

source: །གལ་ཏེ་སྔོན་དངོས་པོ་ཡོད་པར་གྱུར་ལ་ཞེས་བྱ་བ་ནི་སྔོན་ནི་དེ་དག་ཐམས་ཅད་ཡོད་པར་བཟུང་ལ། ཕྱིས་མེད་པར་བཟུང་ན་ནི་ཉེས་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: If something that really existed was there before”— this means that if they were to grasp all those they grasped as there before as not there later, “there would be the fault.” “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་གང་ལགས་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: Lord, what is the bodhisattva great beings’ path?”

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བས་བསྡུས་པའི་ལམ་ཞུས་པའོ།
en: is a question about the path that comprises bringing beings to maturity and purifying a buddhafield.

source: །དེའི་འོག་ཏུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བཤད་པ་དང་། ལམ་བཤད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་བསླབ་པར་བཤད་པ་དང་། མི་གནས་བཤད་པ་རྣམས་ནི་གཞུང་གི་རྗེས་སུ་བསྙགས་ཏེ་གཟུང་ངོ་།
en: Then the explanation of the six perfections, the explanation of the path, the explanation of the training in all dharmas, and the explanation of no location can be grasped from a close reading of the scripture. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མ་མཆིས་པ་ལགས་ན། འོ་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་སྐྱེས་པར་བགྱིད་ཅེས་བྱ་བ་ནི་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པར་བྱ་ཞེས་བྱ་བའི་ཚིག་མི་རིགས་སོ་སྙམ་དུ་དགོངས་པའོ།
en: Lord, if all dharmas are unproduced, well then, Lord, how will bodhisattva great beings produce a path to awakening?” This intends that the statement “they should produce the unproduced” is not logical.

source: །ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ་སྟེ།
en: With, “All dharmas have not been produced. How so?

source: དེ་ཡང་ཇི་ལྟ་བུ་ཞེ་ན་གང་དག་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་དག་ལ་ནི་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པའོ་ཞེས་བྱ་བ་གང་དག་རྣམ་པར་མི་རྟོག་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་ནས་བསོད་ནམས་དང་བསོད་ནམས་མ་ཡིན་པ་ལ་སོགས་པ་ཅི་ཡང་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་དག་ཉིད་ལ་ནི་མ་སྐྱེས་པའོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་གང་དག་ཡོངས་སུ་མི་ཤེས་པས་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་ལ་ནི་ཆོས་ཐམས་ཅད་སྐྱེས་པ་ཉིད་དོ་ཞེས་གསུངས་པའོ།
en: All dharmas have not been produced for those who do not occasion anything,” it says that all dharmas have not been produced just for those abiding in nonconceptual meditative stabilization who do not occasion anything good or bad and so on, but they are indeed produced for those foolish, noncomprehending ordinary people who do occasion things.

source: །བཅོམ་ལྡན་འདས་འོ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་ཞེས་བྱ་བ་ལ་སོགས་པས་གནས་བརྟན་གྱིས་འདི་སྐད་ཞུས་ཏེ། ཆོས་ཉིད་ནི་དུས་ཐམས་ཅད་དུ་རྣམ་པ་ཐམས་ཅད་དུ་ཕྱིན་ཅི་མ་ལོག་པའི་མཚན་ཉིད་ཡིན་ན། དེ་བྱིས་པ་རྣམས་ལ་ནི་སྐྱེ་བའི་ཆོས་ཅན་དུ་འགྱུར་ལ། མཁས་པ་རྣམས་ལ་ནི་མི་འགྱུར་བ་དེ་ཇི་ལྟར་རིགས་པར་འགྱུར་ཞེས་བྱའོ།
en: With “Lord, whether the tathāgatas arise or whether the tathāgatas do not arise,” and so on, the elder asks how, if the true nature of dharmas is at all times marked as completely unmistaken, could it be logical that it comes to possess the attribute of production for ordinary beings and does not come to do so for the learned?

source: །དེ་སྐད་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་དེ་དེ་བཞིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་བསྟན་ཏེ།
en: Having said that, the Lord said, “Exactly so, Subhūti,” and so on.

source: ཆོས་ཉིད་ལ་ནི་ནམ་ཡང་ཕྱིན་ཅི་ལོག་ཡོད་པ་མ་ཡིན་གྱི།
en: He is teaching that in the true nature of dharmas there is never any mistake, but, because of the fault of not comprehending, foolish ordinary people say of falsely imagined phenomena that “they are produced.”

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཡོངས་སུ་མི་ཤེས་པའི་ཉེས་པས་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་སྐྱེ་བར་འགྱུར་རོ་ཞེས་ཀུན་བརྟགས་པ་རྣམས་ཀྱི་ཀུན་བརྟགས་པ་ཉིད་སྐྱེ་བ་ལས་དགོངས་ཏེ་བཤད་ཀྱི།
en: He intends to say that production is just of falsely imagined phenomena from falsely imagined phenomena.

source: ཆོས་ཉིད་ལས་དགོངས་པ་ནི་མ་ཡིན་ནོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: He does not intend that it is from the true nature of dharmas.

source: གནས་བརྟན་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ཅི་ལགས་སྐྱེས་པར་འགྱུར་བའི་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ལགས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཀྱི་སྐྱེ་བ་དང་མི་སྐྱེ་བ་ཞུས་སོ།
en: Having said that, the elder Subhūti said, “Lord, do they reach awakening on that path that has been produced?” and so on, is an inquiry about the production and nonproduction of dharmas without outflows. “

source: །བྱང་ཆུབ་ཉིད་ཀྱང་ལམ་མོ་ལམ་ཉིད་ཀྱང་བྱང་ཆུབ་པོ་ཞེས་བྱ་བ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ།
en: Just awakening is the path, and just the path is awakening.”

source: གཉི་ག་ཡང་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་བྱང་ཆུབ་དང་། ལམ་དག་ལ་ཐ་དད་པ་གང་ཡང་མེད་མོད་ཀྱི། འོན་ཀྱང་སྔོན་གྱི་གནས་སྐབས་ནི་རྒྱུ་ཡིན་པའི་ཕྱིར་ལམ་ཞེས་བྱ། ཕྱི་མའི་གནས་སྐབས་ལ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ།
en: The Lord is saying there is no difference between the path and awakening because both are divisions of the pure dharma-constituent, but still, during the earlier time period it is called “path” because it is the cause, and during the later time period it is called “awakening.”

source: །དོན་དམ་པར་ནི་དེ་གཉིས་ཐ་དད་པ་མ་ཡིན་པའི་ཕྱིར་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ཞེ་འམ། ལམ་མ་ཡིན་པས་ཐོབ་པར་འགྱུར་ཞེས་བརྗོད་དུ་མི་རུང་བར་བསྟན་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་ཉིད་ཀྱང་ལམ་ལགས་ལ། ལམ་ཉིད་ཀྱང་བྱང་ཆུབ་ལགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་གནས་བརྟན་གྱིས་འདི་སྐད་ཞུས་ཏེ།
en: He is explaining that ultimately, because those two are not different, it is not suitable to say “they reach awakening on the path” or “they reach it without a path.”

source: གལ་ཏེ་བྱང་ཆུབ་དང་ལམ་དག་ལ་ཐ་དད་པ་མེད་ན། དེ་ལྟ་ན་ནི་ལམ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །དེ་ལྟ་ན་ནི་གཟུགས་ཀྱི་སྐུར་གཏོགས་པ་དང་། ཆོས་ཀྱི་སྐུར་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་ཐོབ་པར་འགྱུར་རོ་ཞེས་བྱ་བའོ། །དེ་སྐད་ཞུས་པ་དང་།
en: With “Lord, if just awakening is the path, and just the path is awakening,” and so on, the elder asks: if the path and awakening are not different, in that case bodhisattvas who have reached the path will have reached awakening, in which case bodhisattvas will have obtained all the buddhadharmas included in the form body and included in the dharma body.

source: བཅོམ་ལྡན་འདས་ཀྱིས། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་ཅེས་བྱ་བའི་ཚིག་དེ་མ་བཞེད་ནས། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་བམ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཀའ་སྩལ་ཏེ།
en: Having asked that, the Lord, who does not accept the statement that “a buddha reaches awakening,” asked him in return, “Subhūti, what do you think, does a buddha reach awakening?”

source: སངས་རྒྱས་དང་བྱང་ཆུབ་ཐ་དད་པ་མེད་པའི་ཕྱིར་དེའི་ཚིག་མི་འཐད་དོ་ཞེས་བྱའོ།
en: and so on. He is saying that what he said is not right because a buddha and awakening are not different.

source: །ཇི་ལྟར་ཚིག་དེ་མི་འཐད་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཐོབ་པ་ཉིད་དུ་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚིག་ཀྱང་མི་འཐད་དོ་ཞེས་བསྟན་པའོ།
en: He is teaching that just as that statement is not right, similarly what he said about “bodhisattvas reaching awakening” is not right either.

source: །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་དག་ལ་ཐ་དད་པ་མེད་དུ་ཟིན་ཀྱང་། བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བར་ཀུན་རྫོབ་ཏུ་ཐ་སྙད་ཡོད་པར་ཞལ་གྱིས་བཞེས་ནས། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱས་ཞེས་བྱ་བ་ལ་སོགས་པས་བྱང་ཆུབ་འཐོབ་པའི་རིམ་པ་བསྟན་ཏེ།
en: Then, accepting that even though a bodhisattva and awakening are not different, still, that bodhisattvas reach awakening exists as a conventional designation, with “Subhūti, here bodhisattva great beings, having completed the six perfections,” and so on, he teaches the steps for reaching awakening.

source: དེ་བས་ན་དེ་ལྟར་ཀུན་བརྟགས་པའི་རིམ་པ་ཡོངས་སུ་མ་བཏང་བས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་གྱི་འཕྲལ་ལ་ཐོབ་པ་ནི་མ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: Hence, without totally rejecting such falsely imagined steps as those, he is explaining that they will reach awakening, but not attain it immediately.

source: །དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ཞུས་པ་དང་། དེའི་དབྱེ་བ་དག་ཀྱང་གོ་སླའོ།
en: Then the question about how they will “purify a buddhafield” and the parts to that are easy to understand. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ངེས་ཞེས་བགྱིའམ།
en: Lord, are bodhisattva great beings ‘destined’ or rather ‘not necessarily destined’?”

source: འོན་ཏེ་མ་ངེས་ཞེས་བགྱི་ཞེས་བྱ་བ་ནི་ཅི་ངེས་པ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་འམ། འོན་ཏེ་མ་ངེས་པ་ཉིད་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་ཞེས་ཞུས་པའོ། །ཉན་ཐོས་ཀྱི་ཕུང་པོའམ། རང་སངས་རྒྱས་ཀྱི་ཕུང་པོའམ་ཞེས་བྱ་བ་ནི་ཅི་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སུ་ངེས་པ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའམ་ཞེས་ཞུས་པའོ།
en: is asking whether bodhisattvas are so called when “destined,” or rather bodhisattvas are so called also when “not necessarily destined”; “the śrāvaka group or the pratyekabuddha group” is asking are bodhisattvas so called when destined to be śrāvakas or when destined to be pratyekabuddhas. “

source: །དེ་ལྟ་བུ་ལུས་ཆེད་དུ་བསམས་ཤིང་།
en: He intentionally, with skillful means, appropriated whatever sort of body would be of benefit to beings.”

source: ཐབས་མཁས་པས་ཡོངས་སུ་འཛིན་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་ལ་དབང་ཐོབ་པས་སྐྱེ་བ་ཡོངས་སུ་འཛིན་གྱི། ལས་ཀྱི་དབང་གིས་མི་འདོད་པ་བཞིན་དུ་མ་ཡིན་ནོ།
en: He took birth by obtaining control over birth, not as something unwanted, under the control of karma. “

source: །འཕགས་པ་ཟག་པ་མེད་པའི་ལས་ཀྱིས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་རམ་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ཡན་ཆད་ནི་དེའི་ལས་ཐམས་ཅད་འཕགས་པ་མེད་པ་ཡིན་ནོ།
en: Through a noble action without outflows, do they… take birth in terrible forms of life or…”— from the eighth level all their actions are noble, without outflows. “

source: །དེ་ལ་རེག་པར་འགྱུར་བ་ཅུང་ཟད་ཀྱང་མེད་དོ་ཞེས་བྱ་བ་ནི་སྲིད་པའི་རེག་པའམ། ལྟ་བའི་རེག་པའམ། རྣམ་པར་རྟོག་པའི་རེག་པས་སོ།
en: But they have no contact with them at all”— with the contact of existence, or the contact of looking, or the contact of conceptualizing.

source: །ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་འདུས་པ་ལགས་ཞེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་ཁོངས་སུ་གཏོགས་པའི་ཚིག་མ་བཟོད་ནས་ཞུས་པའོ།
en: Subhūti asks, “How could all dharmas be included in the perfection of wisdom?” having found unbearable the statement that all dharmas are included because the perfection of wisdom is empty of an intrinsic nature.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གཏོང་ངམ་ཞེས་བྱ་བ་ལ་སོགས་པས།
en: With “Subhūti, … all dharmas are empty of all dharmas, are they not?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་ན་ནི་དེའི་ཚེ་ཆོས་གཞན་དག་ཡོད་པར་འགྱུར་རོ། །དེ་ལས་གཞན་པ་མེད་པར་འགྱུར་ན་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོད་པར་འགྱུར་རོ། །དེ་ལྟ་ན་ནི་དེ་མི་རིགས་པར་འགྱུར་ན།
en: and so on, the Lord explains that it does not make sense that when the perfection of wisdom does not exist then other dharmas exist, and when dharmas other than it do not exist the perfection of wisdom exists.

source: འདི་ལྟར་ན་ཐམས་ཅད་ཀྱང་སྟོང་སྟེ། དེའི་ཕྱིར་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་འདུས་པར་རིགས་སོ་ཞེས་སྟོན་ཏོ།
en: It therefore makes sense that they are all empty and included because they have emptiness as a defining mark. “

source: །ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་གནས་ཏེ་མངོན་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་སྒྲུབ་པ་ལགས་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཡིན་ན་རྣམ་པར་སྨིན་པའི་མངོན་པར་ཤེས་པ་མངོན་པར་སྒྲུབ་པ་ཇི་ལྟར་སྒྲུབ་པར་འགྱུར་ཞེས་ཞུས་པའོ།
en: Lord, how do [they]… standing in the emptiness of all dharmas find and produce within themselves the perfection of clairvoyance” is asking how, if they are empty, is it established that they find and produce within themselves the clairvoyances that bring beings to maturity?

source: །སྟོང་པ་ཉིད་ཀྱི་སྒོ་ནས་མངོན་པར་སྒྲུབ་པོ་ཞེས་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་ལ་སོགས་པས་མངོན་པར་ཤེས་པར་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཏུ་གྱུར་པའི་ཆོས་བཤད་པ་དང་། གང་ཟག་ཐ་དད་པ་བསྟན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་ཐར་པར་བྱ་བ་ཞུས་པ་དང་།
en: In order to teach that they find and produce them within themselves through the gateway of emptiness, with the Lord said, “Subhūti, here bodhisattva great beings practicing the perfection of wisdom see all those world systems,” and so on, it teaches the different clairvoyances, explains the dharmas that are “branches of… awakening,” teaches the different persons, asks about freeing beings, responds, and explains that security is close by.

source: ལན་བཏབ་པ་དང་། དགེ་བ་བསྟེན་པ་དག་ནི་གོ་སླའོ།
en: These are easy to understand. “

source: །བཅོམ་ལྡན་འདས་སྡུག་བསྔལ་འཚལ་བས་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རམ། འོན་ཏེ་སྡུག་བསྔལ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་གལ་ཏེ་སྡུག་བསྔལ་དང་།
en: Lord, will beings pass into complete nirvāṇa on account of knowing suffering or will they pass into complete nirvāṇa on account of suffering?”

source: ཀུན་འབྱུང་བ་ལ་སོགས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ན་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ། དེ་དག་ལ་ཡང་སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་ལ་སོགས་པ་ཡོད་པའི་ཕྱིར་རོ། །ཇི་སྟེ་སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ན་ནི་དེ་ལྟ་ན་ཉན་ཐོས་བཞིན་དུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་ཐོབ་པར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས་ཞུས་པའོ།
en: This question intends that were they to pass into nirvāṇa on account of suffering and its origination and so on, all foolish, ordinary persons would also pass into nirvāṇa because they have suffering and the origination and so on; but if they pass into nirvāṇa on account of knowing suffering and knowing its origination and so on, in that case, like śrāvakas, they will have reached the result of stream enterer and so on.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པ་གཉི་ག་ལྟར་ཡང་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་གྱི། དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་མཉམ་པ་ཉིད་རབ་ཏུ་རྟོགས་པས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་བསྟན་ཏོ།
en: Then the Lord teaches that they do not pass into nirvāṇa in either way, but rather pass into nirvāṇa on account of the realization of “the sameness” called suchness. “

source: །གང་དག་བདེན་པར་གཏོགས་པའམ། གང་དག་བདེན་པར་མ་གཏོགས་པ་ཞེས་བྱ་བ་ལ། ནང་གི་ཕུང་པོ་རྣམས་ནི་བདེན་པར་གཏོགས་པའོ། །ཕྱི་རོལ་གྱི་རྣམས་ནི་བདེན་པར་མ་གཏོགས་པའོ།
en: Those dharmas included in the truths or not included in the truths”— the inner aggregates are those “included in the truths,” the external ones are “not included in the truths.” “

source: །རབ་འབྱོར་ཆོས་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྗེས་སུ་ལྟ་བའི་ཆོས་དེ་ལྟ་བུ་མེད་དོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ཉིད་ན་ཆོས་ཐམས་ཅད་མེད་པའོ།
en: Subhūti, such a dharma as that, which bodhisattva great beings see, does not exist.” All phenomena do not exist just in their thoroughly established state. “

source: །དེ་རིགས་ཀྱི་ས་ལ་གནས་ནས་སྤྱི་བོར་ལྟུང་བར་མི་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་དེ་ལ་ཆོས་ལ་འདུན་པའི་སྲེད་པ་མི་བྱེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Those bodhisattvas standing at the Gotra level do not fall onto a peak” means there they do not entertain the craving that causes acting on the desire for the śrāvaka dharmas. “

source: །དེ་སྡུག་བསྔལ་རབ་ཏུ་ཤེས་པས་ཀྱང་སྡུག་བསྔལ་ལ་དམིགས་པའི་སེམས་མི་སྐྱེད་དོ་ཞེས་བྱ་བ་ནི་སྔར་བཤད་པའི་ཚུལ་གྱིས་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པས་ཡོངས་སུ་འདྲིས་པ་འབའ་ཞིག་ཏུ་བྱེད་ཀྱི།
en: Even though they comprehend suffering, they do not produce any thought with suffering as its objective support” means they only master it with the knowledge of thorough mastery in the way explained before.

source: ཉན་ཐོས་ཀྱི་སར་ལྟུང་དུ་དོགས་པའི་ཕྱིར་སེམས་བཅུ་དྲུག་པོ་དག་གིས་དེ་མངོན་སུམ་དུ་བྱས་ནས་མངོན་པར་ནི་མི་བྱེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They do not actualize it with those sixteen mental states knowing impermanence and so on because they fear falling to the śrāvaka level after having done so. “

source: །དངོས་པོ་མེད་པ་ནི་བྱང་ཆུབ་སྟེ་ཞེས་བྱ་བ་ལ།
en: Awakening is a nonexistent thing.” “

source: དངོས་པོ་ནི་འདུས་བྱས་དང་འདུས་མ་བྱས་དང་། བརྟགས་པ་དང་། མ་བརྟགས་པའི་ཆོས་རྣམས་ཏེ།
en: Existent things” are compounded and uncompounded, constructed and unconstructed phenomena.

source: དེའི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར་བརྗོད་དུ་མེད་པ། དོན་དམ་པར་གནས་པའི་བྱང་ཆུབ་ལ་དངོས་པོ་མེད་པ་ཞེས་བྱའོ།
en: Because it is separated from their intrinsic nature, the inexpressible ultimately abiding awakening is called “a nonexistent thing.”

source: །དེ་ནས་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་འཇིག་རྟེན་གསུམ་གྱི་ཆོས་རྣམས་ཀུན་བརྟགས་པ་ཉིད་དུ་སྟོན་ཏོ།
en: Then again, with “unlettered, foolish, ordinary people,” and so on, it teaches that the dharmas of the three realms are just falsely imagined. “

source: །དངོས་པོ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པ་ཉིད་དོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པ་ཡིན་པས་དངོས་པོ་མེད་པའི་བདག་ཉིད་ཁོ་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That which is not real is just not real” means because it is falsely imagined it is simply unreal in itself. “

source: །ལམ་ནི་དངོས་པོ་མ་མཆིས་པའོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ནི་དངོས་པོ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་ཐོས་པ་ཞེས་བྱ་བ་གང་ཡང་མེད་དོ་ཞེས་བསྟན་ཏོ།
en: The path is a nonexistent thing, the result of stream enterer is a nonexistent thing,” and so on, teaches there is no “listening” at all because they are in their intrinsic nature nonexistent things. “
